ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DA48def.inc
; NMI interrupt vector offsets

.equ NMI_voffset = 0

; BOD interrupt vector offsets

.equ BOD_VLM_voffset = 0

; RTC interrupt vector offsets

.equ RTC_CNT_voffset = 0
.equ RTC_PIT_voffset = 2

; CCL interrupt vector offsets

.equ CCL_CCL_voffset = 0

; PORTA interrupt vector offsets

.equ PORTA_PORT_voffset = 0

; TCA0 interrupt vector offsets

.equ TCA0_LUNF_voffset = 0
.equ TCA0_OVF_voffset = 0
.equ TCA0_HUNF_voffset = 2
.equ TCA0_CMP0_voffset = 4
.equ TCA0_LCMP0_voffset = 4
.equ TCA0_CMP1_voffset = 6
.equ TCA0_LCMP1_voffset = 6
.equ TCA0_CMP2_voffset = 8
.equ TCA0_LCMP2_voffset = 8

; TCB0 interrupt vector offsets

.equ TCB0_INT_voffset = 0

; TCB1 interrupt vector offsets

.equ TCB1_INT_voffset = 0

; TCD0 interrupt vector offsets

.equ TCD0_OVF_voffset = 0
.equ TCD0_TRIG_voffset = 2

; TWI0 interrupt vector offsets

.equ TWI0_TWIS_voffset = 0
.equ TWI0_TWIM_voffset = 2

; SPI0 interrupt vector offsets

.equ SPI0_INT_voffset = 0

; USART0 interrupt vector offsets

.equ USART0_RXC_voffset = 0
.equ USART0_DRE_voffset = 2
.equ USART0_TXC_voffset = 4

; PORTD interrupt vector offsets

.equ PORTD_PORT_voffset = 0

; AC0 interrupt vector offsets

.equ AC0_AC_voffset = 0

; ADC0 interrupt vector offsets

.equ ADC0_RESRDY_voffset = 0
.equ ADC0_WCMP_voffset = 2

; ZCD0 interrupt vector offsets

.equ ZCD0_ZCD_voffset = 0

; PTC interrupt vector offsets

.equ PTC_PTC_voffset = 0

; AC1 interrupt vector offsets

.equ AC1_AC_voffset = 0

; PORTC interrupt vector offsets

.equ PORTC_PORT_voffset = 0

; TCB2 interrupt vector offsets

.equ TCB2_INT_voffset = 0

; USART1 interrupt vector offsets

.equ USART1_RXC_voffset = 0
.equ USART1_DRE_voffset = 2
.equ USART1_TXC_voffset = 4

; PORTF interrupt vector offsets

.equ PORTF_PORT_voffset = 0

; NVMCTRL interrupt vector offsets

.equ NVMCTRL_EE_voffset = 0

; SPI1 interrupt vector offsets

.equ SPI1_INT_voffset = 0

; USART2 interrupt vector offsets

.equ USART2_RXC_voffset = 0
.equ USART2_DRE_voffset = 2
.equ USART2_TXC_voffset = 4

; AC2 interrupt vector offsets

.equ AC2_AC_voffset = 0

; TCB3 interrupt vector offsets

.equ TCB3_INT_voffset = 0

; TWI1 interrupt vector offsets

.equ TWI1_TWIS_voffset = 0
.equ TWI1_TWIM_voffset = 2

; PORTB interrupt vector offsets

.equ PORTB_PORT_voffset = 0

; PORTE interrupt vector offsets

.equ PORTE_PORT_voffset = 0

; TCA1 interrupt vector offsets

.equ TCA1_LUNF_voffset = 0
.equ TCA1_OVF_voffset = 0
.equ TCA1_HUNF_voffset = 2
.equ TCA1_CMP0_voffset = 4
.equ TCA1_LCMP0_voffset = 4
.equ TCA1_CMP1_voffset = 6
.equ TCA1_LCMP1_voffset = 6
.equ TCA1_CMP2_voffset = 8
.equ TCA1_LCMP2_voffset = 8

; ZCD1 interrupt vector offsets

.equ ZCD1_ZCD_voffset = 0

; USART3 interrupt vector offsets

.equ USART3_RXC_voffset = 0
.equ USART3_DRE_voffset = 2
.equ USART3_TXC_voffset = 4

; USART4 interrupt vector offsets

.equ USART4_RXC_voffset = 0
.equ USART4_DRE_voffset = 2
.equ USART4_TXC_voffset = 4



.equ INT_VECTORS_SIZE = 116 ; size in words


#endif /* _AVR64DA48DEF_INC_ */

; ***** END OF FILE ******************************************************



